{
    "findings": [
        "Several sections in the provided content appear to be non-compliant with the summarized compliance policy related to the marketing of Treasury-based services. Here are the specific concerns:\n\n1. Prohibited Terminology:\nThe content repeatedly uses the term \"banking\" and variations thereof, such as:\n- \"Powerful banking. Simplified finances.\"\n- \"Bank with complete confidence\"\n- \"Your bank account should do more than hold your money.\"\n- \"Banking services provided by Choice Financial Group, Column N.A., and Evolve Bank & Trust®; Members FDIC.\"\n- \"Manage your banking and financial operations from a single dashboard.\"\n- \"Powerful business banking and finance essentials.\"\n- \"Business banking FDIC-insured bank accounts\"\nThese instances violate the policy's direction to avoid terms like \"banking,\" \"bank account,\" \"bank balance,\" and suggesting receiving banking products directly from bank partners.\n\n2. Yield Compliance Marketing:\nThe line \"Earn up to 4.85% yield on your idle cash with portfolios powered by Vanguard and Morgan Stanley\" could potentially be misleading if it conflates yield with interest. The policy mandates that yield must be referred to as \"yield\" and customers should be notified of any changes to this percentage. It's important to make sure the term \"interest\" is not used in this context.\n\n3. FDIC Insurance Eligibility:\nThe content makes several references to FDIC insurance, which can be compliant as long as it is communicated clearly that accounts are eligible for FDIC pass-through deposit insurance, under certain requirements and conditions. The following sections should be checked to ensure compliance in their context:\n- \"Get up to 20x the industry standard in FDIC insurance through our partner banks and sweep networks.\"\n- \"FDIC-insured bank accounts\" (mentioned multiple times under the pricing section for different packages)\nIt is crucial that these mentions include clear communication that neither the financial technology company (referred to as \"Mercury\") nor the brand offering the product is an FDIC-insured institution and that FDIC insurance eligibility is subject to satisfying FDIC regulations.\n\n4. FAQs about FDIC Insurance:\nThe content should provide customers with clear FAQ information about FDIC insurance but it is currently not apparent in the provided content. This section should explain the implications for customers with deposits in multiple accounts, the protection offered in case of bank failure, and the requirements for FDIC pass-through insurance eligibility.\n\n5. Advertising of Interest Rates or Yield:\nAny reference to earning from the account, such as \"Earn up to 4.85% yield,\" should be compliant with the policy guidelines as they relate to the discussion of yield vs. interest. It should not imply a guaranteed interest rate or conflate yield with interest from the banking partner.\n\nFor corrections:\n- All instances of \"banking\" and similar terms should be revised to compliant terms like \"financial operations\", \"money management\", or specific features like \"bill pay\" or \"cards and expense management.\"\n- The yield should be described in a manner that does not equate it with interest, and the conditions and factors influencing the yield should be made transparent.\n- All references to FDIC insurance should include a clear communication about eligibility conditions and the pass-through nature of such insurance.\n- An FAQ section about FDIC insurance should be included, or if it exists, should be made readily accessible to ensure that customers can find detailed information that complies with the policy.",
        "The content presents a few areas that could potentially be non-compliant with the summarized compliance policy provided. Here are the specifics:\n\n1. **Prohibited Terminology**: \n   - The term \"banking\" is used multiple times such as in \"Powerful banking. Simplified finances.\" and \"Efficiently manage your banking and financial operations from a single dashboard.\" This term should not be used because it may imply that the financial services are being provided directly by a bank, which is contrary to the policy requiring avoidance of any phrase that suggests receiving banking products directly from bank partners.\n   - The phrase \"Bank with complete confidence\" also implies the provision of banking services directly rather than through a partner bank. \n\n2. **Yield Compliance Marketing**: \n   - The phrase \"Earn up to 4.85% yield on your idle cash with portfolios powered by Vanguard and Morgan Stanley\" might be conflating yield with interest because it implies a return on cash similar to interest earnings. The terminology here should be carefully presented to avoid confusion with interest and to comply with the rule of not implying that yield is pass-through interest from a bank partner.\n\n3. **FDIC Insurance Eligibility**:\n   - The phrase \"Get up to 20x the industry standard in FDIC insurance through our partner banks and sweep networks.\" could potentially imply a guarantee of FDIC pass-through insurance eligibility which is not allowed per the compliance policy. It needs to clearly state that while the accounts are eligible for FDIC pass-through deposit insurance, it is under certain requirements and conditions without giving the impression of an absolute guarantee.\n   - The statement \"FDIC-insured bank accounts\" is repeated multiple times, which could mislead customers into thinking that the Mercury accounts themselves are FDIC insured rather than the partner bank holding the funds. More clarity might be required to ensure customer understanding aligns with the actual conditions for FDIC pass-through insurance. \n\n4. **Use of Recommended Terms**:\n   - Although not outright non-compliant, the use of terms like \"business banking\" might need review or rephrasing to align more closely with the recommended terminology like \"financial services\" and to prevent any misunderstanding that banking services are being directly provided. \n\nTo comply with the policy, the content should be revised to avoid the impression that Mercury provides traditional banking services or FDIC insurance directly, and to make clear the terms and conditions under which the yields are offered and FDIC insurance applies. It is also important to maintain distinct clarity between interest and yield, ensuring that customers are not misled into thinking they are the same.",
        "Several sections of the content provided contain non-compliant terminology and may violate the summarized compliance policy. Here's the analysis:\n\n1. Non-compliant use of \"banking\" terminology:\n- \"Open AccountBankingBusiness Checking & SavingsTreasuryCorporate Credit CardsWorking CapitalVenture DebtPersonal Banking\"\n- \"Powerful banking. Simplified finances.\"\n- \"Let banking power your financial operations\"\n- \"Efficiently manage your banking and financial operations from a single dashboard.\"\n- \"Complete any banking task in just a few clicks\"\n  \n  These phrases suggest that the user is receiving banking services directly from Mercury, which is not an FDIC-insured bank but a fintech company. Such language could be construed as implying that Mercury operates as a bank, which it does not, potentially misleading the customer.\n\n2. Non-compliant description of interest:\n- \"Earn up to 4.85% yield on your idle cash with portfolios powered by Vanguard and Morgan Stanley\"\n\n  This could potentially conflate yield with interest, which the policy advises against. While \"yield\" is used here, there should be careful explanation that this is not the equivalent of interest and does not suggest pass-through interest from a bank partner.\n\n3. Issues related to FDIC insurance claims:\n- \"Get up to 20x the industry standard in FDIC insurance through our partner banks and sweep networks.\"\n- \"Your deposits are held in your name in federally regulated accounts facilitated by our banking partners.\"\n  \n  These statements need to clarify that FDIC insurance is pass-through and provided under certain conditions. There should be no guarantees of FDIC insurance or its eligibility unless the customer's circumstances fit FDIC rules.\n\n4. Inappropriate use of \"bank\" related terms for accounts:\n- \"FDIC-insured bank accounts\"\n  \n  This usage may give the impression that the accounts are directly provided by Mercury as a bank, which is not accurate. The recommended terminology would be \"FDIC-insured financial accounts\" or similar, to avoid implying that Mercury offers banking products directly.\n\nFor compliance, the content should be revised to:\n- Replace \"banking\" and related terms with approved terms such as \"financial services,\" \"financial account,\" \"money management,\" etc.\n- Avoid conflating yield with interest and provide clear explanations regarding the nature of the yield.\n- Clearly state the conditions and requirements for FDIC pass-through deposit insurance, ensuring no false guarantees of insurance are made.\n- Use terms recommended by the policy when referring to accounts, avoiding the suggestion that Mercury is a bank or directly offers banking services.",
        "The content has several non-compliant sections based on the summarized compliance policy provided. Here are the issues identified:\n\n1. Prohibited Terminology:\n   - The term \"FDIC-insured bank accounts\" in the section \"Mercury Plus offers\" is non-compliant because it implies that Mercury is offering bank accounts directly, which may be misleading. This contravenes the policy against implying direct provision of banking products.\n   - The use of \"Business banking,\" \"bank account,\" \"banking,\" \"BankingBusiness Checking & Savings\" throughout the text suggests that Mercury is providing banking services directly, which is not compliant with the policy of avoiding these terms.\n\n2. Yield Compliance Marketing:\n   - The phrase \"Up to 4.85% yield ($500K minimum balance)\" might be compliant with the yield terminology, but it needs to be clarified that this is not interest as customers might confuse the yield with interest rates. The content must distinctly separate yield from interest.\n   \n3. FDIC Insurance Eligibility:\n   - While the content does mention \"FDIC insurance\" and \"up to 20x the industry standard in FDIC insurance through our partner banks and sweep networks,\" it needs to ensure that there is clear communication that Mercury (or the branded product) is not FDIC-insured, but rather the funds held at the partner banks are eligible for FDIC pass-through insurance. The phrasing should be more specific about the conditions and requirements for FDIC pass-through insurance eligibility.\n   - The phrase \"Get up to 20x the industry standard in FDIC insurance\" could potentially be misleading if it suggests a guarantee of FDIC insurance without specifying the qualifying conditions.\n   \n4. FAQs about FDIC Insurance:\n   - The content lacks a section explicitly providing customers with answers to common questions about FDIC insurance. Including a clear FAQ about the limits and conditions of the FDIC insurance could improve customer understanding and compliance.\n\nThe content needs revisions to align with the summarized compliance policy and ensure that customers are not misled into believing Mercury is a bank or is offering traditional banking services. Furthermore, clarification is needed regarding the terms and conditions under which FDIC pass-through insurance applies. To be compliant, these revisions must be in accordance with the language and messaging guidelines set forth in the compliance policy.",
        "Based on the compliance policy provided, several sections in the content appear to be non-compliant:\n\n1. _\"Powerful business banking and finance essentials.\"_  \n* **Reason**: The term \"business banking\" might imply that the brand is offering traditional banking products, which is prohibited. It should be replaced with a recommended term like \"money management\" or \"financial services.\"\n\n2. _\"Mercury$0/ Month Powerful business banking\"_  \n* **Reason**: Again, the use of \"business banking\" does not comply with the guidelines. It should be rephrased with approved terminology.\n\n3. _\"Up to 4.85% yield ($500K minimum balance)\"_  \n* **Reason**: While using the term \"yield\" is permitted, there should be clarification to ensure that it is not conflated with \"interest,\" and there is no comparison to the Fed Funds Rate or implication that it is pass-through interest from a bank partner.\n\n4. _\"Business banking FDIC-insured bank accounts\"_  \n* **Reason**: The use of \"business banking\" here is non-compliant for the reasons stated above. Also, mentioning \"FDIC-insured bank accounts\" requires careful communication about the eligibility for FDIC pass-through deposit insurance under certain requirements, avoiding any guarantees unless those conditions are met.\n\n5. _\"Let banking power your financial operations\"_  \n* **Reason**: The phrase \"Let banking power your financial operations\" suggests that Mercury is providing banking services directly, which is likely non-compliant. Instead, it should emphasize that it is offering financial services leveraging banking services provided by FDIC-member partner banks.\n\n6. _\"Your bank account should do more than hold your money.\"_  \n* **Reason**: The term \"bank account\" should not be used as Mercury is not a bank. An appropriate alternative like \"financial account\" or \"money management account\" should be used.\n\n7. _\"Figure A, Mercury01Banking02Treasury...\"_  \n* **Reason**: The term \"Banking\" should be replaced with an approved term such as \"financial services\" to avoid suggesting direct banking products from Mercury.\n\nFurthermore, I would recommend that Mercury adds or makes more conspicuous the clarifying statements about the conditions required for FDIC pass-through deposit insurance, ensuring that neither Mercury nor the brand is an FDIC-insured institution but the funds are held at a partner bank that is a member of the FDIC. Lastly, it may also be necessary to have a FAQ section about FDIC insurance as per the compliance policy if it is not already present elsewhere on the site or in the product documentation.",
        "The provided content contains several instances of non-compliance with the summarized compliance policy. Here are the specific non-compliant sections and the reasons for their non-compliance:\n\n1. Use of \"banking\" and related terms:\n   - \"Let banking power your financial operations\"\n   - \"Efficiently manage your banking and financial operations from a single dashboard.\"\n   - \"Complete any banking task in just a few clicks\"\n   - \"Bank with complete confidence\"\n\n   Reason: These phrases are in direct violation of the policy which prohibits terms like \"banking,\" \"bank account,\" \"bank balance,\" etc. The policy explicitly states not to use phrases that could suggest receiving banking products directly from bank partners.\n\n2. Mention of \"Checking & Savings\":\n   - \"Send and receive payments seamlesslySet auto-transfer rules and send free USD wires.Checking & Savings\"\n\n   Reason: Referring to services as \"Checking & Savings\" implies traditional banking products, which the policy prohibits. Instead, using terms like \"cash management\" or \"financial account\" would be compliant.\n\n3. Claims about FDIC Insurance:\n   - \"Get up to 20x the industry standard in FDIC insurance through our partner banks and sweep networks.\"\n\n   Reason: This statement could be interpreted as a guarantee of FDIC insurance eligibility and coverage level, which the policy advises against. It must be clear that FDIC insurance is subject to certain requirements and conditions and cannot be guaranteed.\n\nTo bring this content into compliance, it would need to be revised to remove or replace prohibited terms and to ensure that any statements about FDIC insurance accurately reflect the policy's guidelines — including not overstating the guarantees of such insurance. References to \"banking\" should be replaced with compliant terms like \"cash management\" or \"financial services,\" and the FDIC insurance information should be clarified to align with regulatory requirements.",
        "The provided content contains several sections that are non-compliant with the summarized compliance policy:\n\n1. Use of \"banking partners,\" \"bank account,\" \"bank balance,\" and \"banking\":\n   - Non-compliant terms used: \"our banking partners,\" \"when your bank account powers your critical financial workflows,\" and \"held in your name in federally regulated accounts facilitated by our banking partners.\"\n   - Reason: The use of terms like \"banking partners,\" \"bank account,\" and any phrase that suggests direct banking relationships contradicts the directive to avoid implying that the service being offered is equivalent to a traditional banking product. \n\n2. Use of \"deposits\":\n   - Non-compliant term used: \"Your deposits are held in your name in federally regulated accounts facilitated by our banking partners.\"\n   - Reason: \"Deposits\" is a prohibited term when referring to the movement or holding of funds, as it might imply a direct banking product.\n\n3. Misrepresentation of FDIC Insurance:\n   - Non-compliant statement: \"Get up to 20x the industry standard in FDIC insurance through our partner banks and sweep networks.\"\n   - Reason: This may be considered misleading because it suggests a guarantee of FDIC insurance level without explaining the specific requirements and conditions for FDIC pass-through insurance eligibility. Also, it fails to disclose that neither the brand nor Stripe is an FDIC-insured institution themselves. It implies a level of FDIC insurance that may not be applicable to all customers or may not be automatically provided.\n\n4. Implication of interest rates:\n   - Non-compliant statement: \"When your bank account powers your critical financial workflows\"\n   - Reason: The combination of \"bank account\" and \"interest rates\" might imply that the customer is receiving interest on their account, which is not allowed as per the policy on yield compliance marketing.\n\nEach of these non-compliant sections must be revised to comply with the guidelines provided in the summarized compliance policy. Corrections could involve rephrasing to use approved terminology, clarifying the nature of the relationship with banking partners, and specifying the conditions for FDIC pass-through insurance. Furthermore, any mention of financial returns needs to avoid implying interest or using the Fed Funds Rate as a benchmark.",
        "Based on the provided compliance policy and the content shared for review, there do not appear to be any explicit non-compliant sections in terms of the specific terminologies and language outlined by the policy.\n\nHowever, it's important to note that I do not have the full context where this content will be used. If this content is part of marketing material or a customer-facing document related to Treasury-based services, certain additional considerations based on the compliance policy should be taken into account:\n\n1. **Recommended Terminology**: Ensure that the financial services being marketed are described using the approved terms like \"money management,\" \"cash management,\" \"[Your brand] account,\" or similar. If the terms \"Stripe bank,\" \"bank account,\" or similar prohibited terms are used elsewhere in the marketing materials where this excerpt is a part of, that would be non-compliant.\n\n2. **Yield Compliance Marketing**: If there's a discussion about yield or interest elsewhere in the materials, it should follow the policy's directives about not conflating yield with interest and not using the Fed Funds Rate as a benchmark.\n\n3. **FDIC insurance eligibility**: If, in the larger document or webpage, the eligibility for FDIC insurance is mentioned, it must be clearly communicated that the funds are held at a partner bank that is a member of FDIC, and there should be an explanation of the conditions required for FDIC pass-through deposit insurance to apply.\n\n4. **FAQs about FDIC insurance**: If FDIC insurance is a relevant topic for this content, the full document should include FAQs that explain its implications comprehensively, such as the protection offered in case of a bank failure and the criteria that must be met for FDIC pass-through insurance eligibility.\n\nSince the excerpt provided does not contain any terminology directly referencing banking functions, interest rates, or FDIC insurance, it does not, in isolation, violate the policy. However, one must consider the entire context in which this excerpt is used to ensure full compliance. If any sections outside this excerpt contradict the policy requirements, those would be the specific non-compliant areas.",
        "Upon reviewing the provided content against the summarized compliance policy, I have identified the following non-compliant sections along with the reasons for non-compliance:\n\n1. \"Earn up to 4.85% yield on your idle cash with portfolios powered by Vanguard and Morgan StanleyStart Earning with Treasury\"\n\n   - **Reason for Non-Compliance**: This statement may potentially conflate yield with interest, violating the guideline that yield should not be conflated with interest. It's also crucial to ensure that it's clear the yield is not pass-through interest from a bank.\n\n2. The repeated use of \"Mercury Treasury\" must be closely scrutinized in context. If \"Mercury Treasury\" is being presented in a way that suggests it operates as a bank or offers FDIC-insured products directly instead of through a partner bank, this could be non-compliant.\n\n   - **Reason for Potential Non-Compliance**: If \"Treasury\" in this context implies banking services, it may suggest that the customers are receiving banking products directly from the brand, which is prohibited. Compliance would depend on the context and additional information provided with the term.\n\n3. The repeated statements do not explicitly include prohibited terminology, yield compliance marketing issues, or incorrect references to FDIC insurance; however, the context in which they are used could potentially be misleading or incomplete based on the rest of the content or marketing materials not included here.\n\nTo ensure full compliance, the content should make it clear that the services provided are not direct banking services, the yield is not interest and is not directly related to the Fed Funds Rate, and that FDIC insurance eligibility is appropriately explained, fulfilling all conditions set by FDIC regulations. Moreover, there should be clear and detailed FAQs regarding FDIC insurance to educate customers on their coverage and eligibility.\n\nAny discrepancies or areas of concern should be adjusted to align with the guidelines and then reviewed again to confirm compliance.",
        "The content provided contains several sections that are non-compliant with the summarized compliance policy and need to be revised:\n\n1. Prohibited terminology:\n- \"Stripe bank,\" or any similar phrase that suggests a banking product from a partner bank is not allowed. While \"Stripe\" is not explicitly mentioned in the provided content, if \"Mercury\" is the branding for Stripe-based products/services, then phrases like \"Mercury bank\" would be prohibited.\n- \"FDIC-insured bank accounts\" - This phrasing could mislead customers into thinking that the account itself is an FDIC-insured bank, while it should specify that it is eligible for FDIC pass-through deposit insurance.\n\n2. Yield compliance marketing:\n- \"Up to 4.85% yield ($500K minimum balance)\" - While specifying yield is permitted, this statement could be seen as conflating yield with interest unless it's clarified that \"yield\" does not refer to interest paid by the bank.\n\n3. FDIC insurance eligibility:\n- There's no clear communication that accounts are eligible for FDIC pass-through deposit insurance under specific requirements and conditions. This must be clearly stated to avoid implying a guarantee of FDIC insurance, which could mislead customers.\n\nTo correct these non-compliant sections, the specific language used must be changed to ensure it adheres to the terms recommended by the compliance policy, such as referring to \"financial accounts\" with \"eligibility for FDIC pass-through insurance\" and avoiding any terminology that suggests traditional banking. Additionally, definitions and clarifications regarding yield and FDIC pass-through insurance eligibility must be made transparent to the customer.",
        "Based on the summarized compliance policy provided, here are the specific non-compliant sections from the content and the reasons why they are non-compliant:\n\n1. **Use of Prohibited Terminology**:\n   - \"**Access powerful banking for free**\": This phrase uses the term \"banking,\" which is prohibited in the policy as it suggests that the customers are receiving direct banking products. The term \"banking\" implies that the service is a bank, which it is not.\n   - \"**Business banking**\": This term is used repeatedly in the content and is prohibited for the same reason as above.\n\n2. **Misleading Yield Information**:\n   - \"**Up to 4.85% yield**\": The policy mandates that yield should not be conflated with interest. This line on its own does not make clear whether \"yield\" refers to interest or not, which can cause confusion. Also, the content should explicitly notify customers about changes in the yield percentage, but it does not.\n   - \"**Also guaranteed at $10M+ in deposits**\": This statement can be interpreted as a guarantee of the yield, which might be misleading unless conditions on such guarantees are also clearly communicated.\n\n3. **FDIC Insurance Misrepresentation**:\n   - Although the term \"FDIC-insured bank accounts\" is used accurately reflecting FDIC pass-through deposit insurance, it lacks the accompanying disclosure that neither Stripe nor the branding entity (in this case, Mercury) is FDIC-insured. Without this additional clarification, there might be a misunderstanding of the extent and conditions of the FDIC insurance coverage. The policy requires clear communication on eligibility and conditions.\n\nThe content will require revisions to remove or replace prohibited terms like \"banking\" with compliant terms from the recommended list such as \"financial services\" or \"money management.\" Additionally, it must include explicit and clear disclaimers regarding the nature of yield percentages and conditions of FDIC insurance to comply with the given policy.",
        "Upon reviewing the content provided, there are specific sections that appear to be non-compliant with the summarized compliance policy:\n\n1. **Use of \"banking\" and variations**: The terms \"Business banking\" and \"FDIC-insured bank accounts\" are used multiple times throughout the content. The compliance policy states that terms like \"banking,\" \"bank account,\" and \"bank balance\" should not be used. The use of these terms can mislead customers into thinking the services offered are banking products directly from the partner banks.\n\n   Correction: Replace these with \"financial services,\" \"[Your Brand] account,\" \"financial account,\" \"store of funds,\" \"wallet,\" \"stored-value account,\" or \"eligible for FDIC pass-through insurance,\" depending on context, and ensure accurate representation of the relationship with partner banks.\n\n2. **Misleading assertions about FDIC insurance**: The repeated phrase \"FDIC-insured bank accounts\" suggests a guarantee of FDIC insurance, which can be misleading. The policy clearly states that such terms should be used carefully, avoiding guarantees of FDIC insurance or implications of pass-through insurance eligibility unless it satisfies the conditions set by FDIC regulations.\n\n   Correction: Clarify the conditions under which FDIC pass-through deposit insurance applies, and specify that neither Stripe nor your brand is an FDIC-insured institution but rather, the funds are held at a partner bank that is a member of FDIC.\n\n3. **Guarantee of yield**: The mention of \"Up to 4.85% yield\" is repeated multiple times. While mentioning the yield is not against the policy, there must be no conflation of yield with interest, and it must be made clear that the yield is not a pass-through interest from a bank partner.\n\n   Correction: Ensure the term \"yield\" is not used interchangeably with \"interest” and avoid implying any benchmarks related to Fed Funds Rate or other bank interest rates.\n\n4. **Missing FAQ**: The content does not seem to include the \"FAQs about FDIC insurance\" that \"provide customers with answers to common questions about FDIC insurance.\" This inclusion is necessary to comply with the policy requirement of educating customers about FDIC insurance, the protection offered, and the eligibility requirements for pass-through insurance.\n\n   Correction: Include a section of FAQs that explain FDIC insurance, especially as it applies to accounts in scope, to meet the compliance requirements.\n\nBased on these findings, the non-compliant sections of the provided content should be revised to adhere to the summarized compliance policy before being used in marketing or other customer-facing materials.",
        "The following sections of the provided content appear to be non-compliant with the summarized compliance policy:\n\n1. \"Banking services provided by Choice Financial Group, Column N.A., and Evolve Bank & Trust, Members FDIC.\"\nReason: The term \"Banking\" should not be used as it implies that the services are being received directly from a bank partner. This could be misleading and is not compliant with the requirement to avoid terminology like \"banking\" or phrases that suggest direct banking services.\n\n2. \"BankingBusiness Checking & SavingsTreasuryCorporate Credit CardsWorking CapitalVenture DebtPersonal Banking\"\nReason: The terms \"Banking,\" \"Business Checking & Savings,\" and \"Personal Banking\" suggest traditional banking products which the brand is not authorized to provide directly. These terms are prohibited and should be avoided as per the policy.\n\n3. \"Relationship ManagerAlso guaranteed at $10M+ in deposits\"\nReason: Using the term \"guaranteed\" in relation to deposits may imply a guarantee of FDIC insurance which could be misleading unless it fulfills specific FDIC regulations requirements. The compliance policy states that we should avoid guarantees of FDIC insurance or pass-through insurance eligibility unless satisfying the conditions set by FDIC regulations.\n\nRecommended corrective actions:\n\n- Replace the term “Banking” with acceptable terms like “financial services” or “money management” when referring to the services provided.\n- Instead of \"Business Checking & Savings\" and \"Personal Banking,\" use alternative phrasings such as \"[Your Brand] account,\" \"financial account,\" or \"cash management services.\"\n- Clarify the conditions under which FDIC pass-through deposit insurance applies and ensure that any references to guarantees related to deposits are accurate and comply with FDIC regulations.\n\nLastly, the disclaimer \"Mercury is a fintech company, not an FDIC-insured bank.\" aligns with the compliance policy to disclose that the brand is not FDIC-insured. However, care should be taken in all communications to consistently use recommended terminology and clearly outline the nature of FDIC pass-through insurance eligibility as required by FDIC regulations.",
        "The provided content \"FDIC-insured bank Choice Financial Group Column N.A. Evolve Bank & Trust\" is too fragmented to fully assess for compliance with the given policy. It appears to be a list or a table header that might pertain to partner banks associated with the Treasury-based services being offered. The content itself does not contain any overtly non-compliant terminology; however, it lacks context and does not directly convey any of the key compliance requirements.\n\nFor a full compliance check, the content should meet the following requirements based on your summarized policy:\n\n1. It should not suggest that the service is a banking product directly from the bank partner.\n2. It should adequately explain the nature of the FDIC pass-through insurance, without suggesting guarantees not backed by FDIC regulations.\n3. It should provide proper terminology that aligns with the recommended terms such as \"financial services,\" \"stored-value account,\" or \"eligible for FDIC pass-through insurance.\"\n\nThe terms \"FDIC-insured bank Choice Financial Group\" and \"Evolve Bank & Trust\" are likely referring to the partner banks, which is permissible as long as it's clear that the service is not a direct banking product of these banks and that the FDIC insurance is pass-through.\n\nRecommended actions:\n- Ensure that, when using these bank names in content, they are clearly associated with the role they play as partner institutions in relation to the FDIC pass-through insurance eligibility.\n- Provide more context to the content to ensure it includes all necessary information in line with your policy.\n- Check the full content where these names appear to ensure all of the key compliance requirements are met."
    ]
}